**plans**
dev
```
Acquiring state lock. This may take a few moments...
data.aws_subnet.subnet_id_a: Reading...
data.aws_subnet.subnet_id_c: Reading...
data.aws_autoscaling_group.selected: Reading...
data.aws_subnet.subnet_id_b: Reading...
data.aws_launch_template.selected: Reading...
data.aws_elb.selected: Reading...
data.aws_subnet.subnet_id_b: Read complete after 0s [id=subnet-8d3dd6e9]
data.aws_subnet.subnet_id_c: Read complete after 0s [id=subnet-2c4e176a]
data.aws_subnet.subnet_id_a: Read complete after 0s [id=subnet-d6f512a0]
data.aws_launch_template.selected: Read complete after 1s [id=lt-0dde36914873ae8b6]
data.aws_autoscaling_group.selected: Read complete after 1s [id=dsva-vagov-dev-deployment-vagov-dev-vets-api-server-20220810-194214-asg]
data.aws_elb.selected: Read complete after 1s [id=dsva-vagov-dev-vets-api-elb]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.vets-api-server will be created
  + resource "aws_autoscaling_group" "vets-api-server" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 120
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 6
      + metrics_granularity       = "1Minute"
      + min_size                  = 3
      + name                      = "dsva-vagov-dev-deployment-vagov-dev-vets-api-server-20220810-194214-asg-evss-bgs-split"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = [
          + "OldestLaunchTemplate",
        ]
      + vpc_zone_identifier       = [
          + "subnet-2c4e176a,subnet-d6f512a0,subnet-8d3dd6e9",
        ]
      + wait_for_capacity_timeout = "10m"

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + min_healthy_percentage = 50
              + skip_matching          = false
            }
        }

      + launch_template {
          + id      = "lt-0dde36914873ae8b6"
          + name    = (known after apply)
          + version = "$Default"
        }
    }

  # aws_elb.vets-api-server will be created
  + resource "aws_elb" "vets-api-server" {
      + arn                         = (known after apply)
      + availability_zones          = (known after apply)
      + connection_draining         = true
      + connection_draining_timeout = 30
      + cross_zone_load_balancing   = false
      + desync_mitigation_mode      = "defensive"
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 120
      + instances                   = (known after apply)
      + internal                    = true
      + name                        = "dsva-vagov-dev-vets-api-bgs"
      + security_groups             = [
          + "sg-9eaa28f9",
        ]
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = [
          + "subnet-2c4e176a",
          + "subnet-8d3dd6e9",
          + "subnet-d6f512a0",
        ]
      + tags_all                    = {
          + "application" = "vets-api"
          + "environment" = "dev"
          + "managed_by"  = "Terraform"
          + "purpose"     = "mitigate latency issues as per https://dsva.slack.com/archives/C03STQZ40DQ"
          + "repo"        = "https://github.com/department-of-veterans-affairs/vsp-infra-evss-bgs-split"
        }
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 3
          + interval            = 30
          + target              = "HTTP:3004/"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 3004
          + instance_protocol = "HTTP"
          + lb_port           = 3004
          + lb_protocol       = "HTTP"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
staging
```
> tf plan
Acquiring state lock. This may take a few moments...
data.aws_subnet.subnet_id_a: Reading...
data.aws_subnet.subnet_id_c: Reading...
data.aws_elb.selected: Reading...
data.aws_subnet.subnet_id_b: Reading...
data.aws_autoscaling_group.selected: Reading...
data.aws_launch_template.selected: Reading...
data.aws_subnet.subnet_id_a: Read complete after 0s [id=subnet-70f51206]
data.aws_subnet.subnet_id_c: Read complete after 0s [id=subnet-b84e17fe]
data.aws_subnet.subnet_id_b: Read complete after 0s [id=subnet-cc3cd7a8]
data.aws_autoscaling_group.selected: Read complete after 0s [id=dsva-vagov-staging-deployment-vagov-staging-vets-api-server-20220810-194219-asg]
data.aws_launch_template.selected: Read complete after 1s [id=lt-0301a333d650b33b1]
data.aws_elb.selected: Read complete after 1s [id=dsva-vagov-staging-vets-api-elb]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.vets-api-server will be created
  + resource "aws_autoscaling_group" "vets-api-server" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 120
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 12
      + metrics_granularity       = "1Minute"
      + min_size                  = 6
      + name                      = "dsva-vagov-staging-deployment-vagov-staging-vets-api-server-20220810-194219-asg-evss-bgs-split"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = [
          + "OldestLaunchTemplate",
        ]
      + vpc_zone_identifier       = [
          + "subnet-cc3cd7a8,subnet-b84e17fe,subnet-70f51206",
        ]
      + wait_for_capacity_timeout = "10m"

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + min_healthy_percentage = 50
              + skip_matching          = false
            }
        }

      + launch_template {
          + id      = "lt-0301a333d650b33b1"
          + name    = (known after apply)
          + version = "$Default"
        }
    }

  # aws_elb.vets-api-server will be created
  + resource "aws_elb" "vets-api-server" {
      + arn                         = (known after apply)
      + availability_zones          = (known after apply)
      + connection_draining         = true
      + connection_draining_timeout = 30
      + cross_zone_load_balancing   = false
      + desync_mitigation_mode      = "defensive"
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 120
      + instances                   = (known after apply)
      + internal                    = true
      + name                        = "dsva-vagov-staging-vets-api-bgs"
      + security_groups             = [
          + "sg-854cc6e2",
        ]
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = [
          + "subnet-70f51206",
          + "subnet-b84e17fe",
          + "subnet-cc3cd7a8",
        ]
      + tags_all                    = {
          + "application" = "vets-api"
          + "environment" = "staging"
          + "managed_by"  = "Terraform"
          + "purpose"     = "mitigate latency issues as per https://dsva.slack.com/archives/C03STQZ40DQ"
          + "repo"        = "https://github.com/department-of-veterans-affairs/vsp-infra-evss-bgs-split"
        }
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 3
          + interval            = 30
          + target              = "HTTP:3004/"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 3004
          + instance_protocol = "HTTP"
          + lb_port           = 3004
          + lb_protocol       = "HTTP"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
prod
```
Acquiring state lock. This may take a few moments...
data.aws_subnet.subnet_id_a: Reading...
data.aws_subnet.subnet_id_b: Reading...
data.aws_elb.selected: Reading...
data.aws_launch_template.selected: Reading...
data.aws_subnet.subnet_id_c: Reading...
data.aws_autoscaling_group.selected: Reading...
data.aws_subnet.subnet_id_a: Read complete after 0s [id=subnet-f3f31485]
data.aws_subnet.subnet_id_b: Read complete after 0s [id=subnet-a433d8c0]
data.aws_subnet.subnet_id_c: Read complete after 0s [id=subnet-66411820]
data.aws_launch_template.selected: Read complete after 0s [id=lt-06c6752970f3ee877]
data.aws_autoscaling_group.selected: Read complete after 1s [id=dsva-vagov-prod-deployment-vagov-prod-vets-api-server-20220810-190140-asg]
data.aws_elb.selected: Read complete after 1s [id=dsva-vagov-prod-vets-api-elb]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.vets-api-server will be created
  + resource "aws_autoscaling_group" "vets-api-server" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 120
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 32
      + metrics_granularity       = "1Minute"
      + min_size                  = 16
      + name                      = "dsva-vagov-prod-deployment-vagov-prod-vets-api-server-20220810-190140-asg-evss-bgs-split"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = [
          + "OldestLaunchTemplate",
        ]
      + vpc_zone_identifier       = [
          + "subnet-f3f31485,subnet-66411820,subnet-a433d8c0",
        ]
      + wait_for_capacity_timeout = "10m"

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + min_healthy_percentage = 50
              + skip_matching          = false
            }
        }

      + launch_template {
          + id      = "lt-06c6752970f3ee877"
          + name    = (known after apply)
          + version = "$Default"
        }
    }

  # aws_elb.vets-api-server will be created
  + resource "aws_elb" "vets-api-server" {
      + arn                         = (known after apply)
      + availability_zones          = (known after apply)
      + connection_draining         = true
      + connection_draining_timeout = 30
      + cross_zone_load_balancing   = false
      + desync_mitigation_mode      = "defensive"
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 120
      + instances                   = (known after apply)
      + internal                    = true
      + name                        = "dsva-vagov-prod-vets-api-bgs"
      + security_groups             = [
          + "sg-2d6cf84a",
        ]
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = [
          + "subnet-66411820",
          + "subnet-a433d8c0",
          + "subnet-f3f31485",
        ]
      + tags_all                    = {
          + "application" = "vets-api"
          + "environment" = "prod"
          + "managed_by"  = "Terraform"
          + "purpose"     = "mitigate latency issues as per https://dsva.slack.com/archives/C03STQZ40DQ"
          + "repo"        = "https://github.com/department-of-veterans-affairs/vsp-infra-evss-bgs-split"
        }
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 3
          + interval            = 30
          + target              = "HTTP:3004/"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 3004
          + instance_protocol = "HTTP"
          + lb_port           = 3004
          + lb_protocol       = "HTTP"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```